# PrimaryOptionId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PrimaryOptionId Property
ParameterTypeId Class See Also
---
"Primary Option Id"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PrimaryOptionId { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PrimaryOptionId As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PrimaryOptionId {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace